FilesystemAndDisk_Test/FS_Disk_SSD_980_NVMe_scripts/980_fs_fio_test_read_ranseq/rand_read_block_512k_1_64_jobs.out
rand_read_test: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 64 processes

rand_read_test: (groupid=0, jobs=64): err= 0: pid=428762: Mon May 20 23:57:01 2024
  read: IOPS=1700, BW=850MiB/s (892MB/s)(200GiB/240841msec)
    slat (usec): min=38, max=873, avg=97.79, stdev=15.45
    clat (usec): min=8500, max=42685, avg=37522.31, stdev=414.25
     lat (usec): min=9247, max=43242, avg=37620.87, stdev=411.64
    clat percentiles (usec):
     |  1.00th=[36439],  5.00th=[36963], 10.00th=[36963], 20.00th=[36963],
     | 30.00th=[37487], 40.00th=[37487], 50.00th=[37487], 60.00th=[37487],
     | 70.00th=[37487], 80.00th=[38011], 90.00th=[38011], 95.00th=[38011],
     | 99.00th=[38536], 99.50th=[38536], 99.90th=[38536], 99.95th=[39060],
     | 99.99th=[39060]
   bw (  KiB/s): min=851968, max=919296, per=100.00%, avg=871821.04, stdev=464.56, samples=30784
   iops        : min= 1664, max= 1792, avg=1701.03, stdev= 0.91, samples=30784
  lat (msec)   : 10=0.01%, 20=0.01%, 50=100.00%
  cpu          : usr=0.05%, sys=0.32%, ctx=411538, majf=0, minf=8987
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=409600,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=850MiB/s (892MB/s), 850MiB/s-850MiB/s (892MB/s-892MB/s), io=200GiB (215GB), run=240841-240841msec

Disk stats (read/write):
  nvme2n1: ios=409521/0, merge=0/0, ticks=15348682/0, in_queue=15348682, util=100.00%

Test Time: 2024-05-20 23:57:02
Device Name: filetest.txt
Device Info: